{
    "hello": "Hallo! Ich bin",
    "name": "Milica Pesic",
    "job": "Frontend-Entwicklerin",
    "contact": "Kontakt aufnehmen",
    "menu": "Menü",
    "about": "Über mich",
    "skillset": "Fähigkeiten",
    "projects": "Projekte",
    "references": "Referenzen",
    "contactMe": "Kontakt",
    "about_me": "Über mich",
    "about_text_line_1": "Ich verliebte mich in die Frontend-Entwicklung, als ich meine ersten HTML- und CSS-Zeilen geschrieben habe.",
    "about_text_line_2": "Im Laufe der Zeit habe ich meine Fähigkeiten in SCSS, JavaScript und Angular erweitert, wobei ich es genieße, Funktionalität und Design zu kombinieren, um moderne Webanwendungen zu erstellen.",
    "about_text_line_3": "Jedes Projekt bringt etwas Neues, was mich dazu motiviert, meine Fähigkeiten als Frontend-Entwickler kontinuierlich zu verbessern und zu verfeinern.",
    "about_text_line_4": "Lass uns verbinden und zusammen etwas Großartiges schaffen!",
    "let_s_talk": "Lass uns reden",
    "more_about_me": "Mehr über mich",
    "team_player": "Teamplayer",
    "based_in": "Sitz in Tübingen",
    "always_learning": "Immer am Lernen",
    "loves_new_challenges": "Liebt neue Herausforderungen",
    "collaborative_mindset": "Kollaborative Denkweise",
    "core": "Kernkompetenzen",
    "core_text": "Auf meiner Entwicklungsreise habe ich eine Reihe von Frontend-Fähigkeiten erworben, die es mir ermöglichen, dynamische, reaktionsschnelle und benutzerfreundliche Webanwendungen zu erstellen.",
    "core_text1": "Entdecken Sie meine Projekte auf der nächsten Seite und sehen Sie, wie ich diese Technologien einsetze, um dynamische Webanwendungen zu erstellen!",
    "dont_see_skill": "Sehen Sie die gewünschte Fähigkeit nicht?",
    "contact_me": "Zögern Sie nicht, mich zu kontaktieren.\nIch freue mich darauf, mein Wissen weiter auszubauen.",
    "my_work": "Meine Arbeit",
    "explore_work": "Erkunden Sie eine Auswahl meiner Arbeiten hier - Interagieren Sie mit den Projekten, um meine Fähigkeiten in Aktion zu sehen.",
    "join_description": "Task-Manager inspiriert vom Kanban-System. Erstellen und organisieren Sie Aufgaben mit Drag-and-Drop-Funktionen, weisen Sie Benutzer und Kategorien zu.",
    "elpolloloco_description": "Ein lustiges Jump-and-Run-Spiel mit objektorientiertem Ansatz. Helfen Sie Pepe, Münzen und Salsa-Flaschen zu sammeln, um das gefährliches größeres Huhn zu besiegen.",
    "new_project_description": "Neues Projekt kommt bald.",
    "previous_project": "<< Vorheriges Projekt",
    "next_project": "Nächstes Projekt >>",
    "what_my_colleagues_say": "Was meine Kollegen über mich sagen",
    "text_reference1": "Milica hat sich als zuverlässige Gruppenpartnerin erwiesen. Ihre technischen Fähigkeiten und proaktive Herangehensweise waren entscheidend für den Erfolg unseres Projekts.",
    "text_reference2": "Ich hatte das Glück, mit Milica in einem Gruppenprojekt an der Developer Akademie zu arbeiten. Sie blieb immer ruhig, cool und fokussiert und sorgte dafür, dass unser Team auf Erfolg vorbereitet war.",
    "text_reference3": "Unser Projekt profitierte enorm von Milica's effizienter Arbeitsweise.",
    "lets_build_together": "Lass uns gemeinsam etwas Cooles erschaffen!",
    "do_you_have_problem": "Haben Sie ein Problem, das Sie lösen müssen?",
    "contact_intro": "Ich bin ein Webentwickler, der moderne und benutzerfreundlicher Anwendungen erstellt. Egal, ob Sie eine elegante Website oder eine dynamische Webanwendung benötigen, ich bin hier, um Ihre Ideen in die Realität umzusetzen.",
    "thank_you_message": "Vielen Dank für Ihre Nachricht! Ich werde mich bald bei Ihnen melden.",
    "whats_your_name": "Wie ist Ihr Name?",
    "your_name_placeholder": "Ihr Name hier",
    "name_error": "Oops! Ihr Name fehlt noch.",
    "whats_your_email": "Wie lautet Ihre E-Mail-Adresse?",
    "email_placeholder": "ihreemail@email.com",
    "email_error": "Bitte geben Sie eine gültige E-Mail-Adresse ein.",
    "how_can_i_help": "Wie kann ich Ihnen helfen?",
    "message_placeholder": "Hallo Milica, ich interessiere mich für...",
    "message_error": "Was möchten Sie entwickeln lassen?",
    "privacy_police1": "Ich habe die",
    "privacy_police2": "Datenschutzerklärung",
    "privacy_police3": "gelesen und stimme der Verarbeitung meiner Daten zu.",
    "accept_privacy_policy": "Bitte akzeptieren Sie die Datenschutzerklärung.",
    "drop_a_line": "Nachricht senden",
    "imprint": "Impressum",
    "IMPRINT": "Impressum",
    "INFO": "Angaben gemäß § 5 DDG",
    "REPRESENTED_BY": "Vertreten durch:",
    "CONTACT": "Kontakt:",
    "PHONE": "Telefon:",
    "EMAIL": "E-Mail:",
    "LIABILITY_TITLE": "Haftung für Inhalte",
    "LIABILITY_CONTENT1": "Die Inhalte unserer Seiten wurden mit größter Sorgfalt erstellt. Für die Richtigkeit, Vollständigkeit und Aktualität der Inhalte können wir jedoch keine Gewähr übernehmen.",
    "LIABILITY_CONTENT2": "Als Diensteanbieter sind wir gemäß § 7 Abs.1 DDG für eigene Inhalte auf diesen Seiten nach den allgemeinen Gesetzen verantwortlich.",
    "LIABILITY_CONTENT3": "Nach §§ 8 bis 10 DDG sind wir als Diensteanbieter jedoch nicht verpflichtet, übermittelte oder gespeicherte fremde Informationen zu überwachen oder nach Umständen zu forschen, die auf eine rechtswidrige Tätigkeit hinweisen.",
    "LIABILITY_CONTENT4": "Verpflichtungen zur Entfernung oder Sperrung der Nutzung von Informationen nach den allgemeinen Gesetzen bleiben hiervon unberührt.",
    "LIABILITY_CONTENT5": "Eine diesbezügliche Haftung ist jedoch erst ab dem Zeitpunkt der Kenntnis einer konkreten Rechtsverletzung möglich.",
    "LIABILITY_CONTENT6": "Bei Bekanntwerden von Rechtsverletzungen werden wir diese Inhalte umgehend entfernen.",
    "LIABILITY_LINKS_TITLE": "Haftung für Links",
    "LIABILITY_LINKS": "Unser Angebot enthält Links zu externen Websites Dritter, auf deren Inhalte wir keinen Einfluss haben.",
    "LIABILITY_LINKS_TEXT1": "Deshalb können wir für diese fremden Inhalte auch keine Gewähr übernehmen.",
    "LIABILITY_LINKS_TEXT2": "Für die Inhalte der verlinkten Seiten ist stets der jeweilige Anbieter oder Betreiber der Seiten verantwortlich.",
    "LIABILITY_LINKS_TEXT3": "Die verlinkten Seiten wurden zum Zeitpunkt der Verlinkung auf mögliche Rechtsverstöße überprüft.",
    "LIABILITY_LINKS_TEXT4": "Rechtswidrige Inhalte waren zum Zeitpunkt der Verlinkung nicht erkennbar.",
    "LIABILITY_LINKS_TEXT5": "Eine permanente inhaltliche Kontrolle der verlinkten Seiten ist jedoch ohne konkrete Anhaltspunkte einer Rechtsverletzung nicht zumutbar.",
    "LIABILITY_LINKS_TEXT6": "Bei Bekanntwerden von Rechtsverletzungen werden wir derartige Links umgehend entfernen.",
    "COPYRIGHT_TITLE": "Urheberrecht",
    "COPYRIGHT_TEXT1": "Die durch die Seitenbetreiber erstellten Inhalte und Werke auf diesen Seiten unterliegen dem deutschen Urheberrecht.",
    "COPYRIGHT_TEXT2": "Die Vervielfältigung, Bearbeitung, Verbreitung und jede Art der Verwertung außerhalb der Grenzen des Urheberrechts bedürfen der schriftlichen Zustimmung des jeweiligen Autors bzw. Erstellers.",
    "COPYRIGHT_TEXT3": "Downloads und Kopien dieser Seite sind nur für den privaten, nicht kommerziellen Gebrauch gestattet.",
    "COPYRIGHT_TEXT4": "Soweit die Inhalte auf dieser Seite nicht vom Betreiber erstellt wurden, werden die Urheberrechte Dritter beachtet.",
    "COPYRIGHT_TEXT5": "Insbesondere werden Inhalte Dritter als solche gekennzeichnet.",
    "COPYRIGHT_TEXT6": "Sollten Sie trotzdem auf eine Urheberrechtsverletzung aufmerksam werden, bitten wir um einen entsprechenden Hinweis.",
    "COPYRIGHT_TEXT7": "Bei Bekanntwerden von Rechtsverletzungen werden wir derartige Inhalte umgehend entfernen.",
    "IMPRINT_GENERATOR": "Impressum erstellt durch:",

    
        "PRIVACY_POLICY": "Datenschutzrichtlinie",
        "LAST_UPDATED": "Zuletzt aktualisiert: 06. März 2025",
        "INTRO_TEXT": "Diese Datenschutzrichtlinie beschreibt unsere Richtlinien und Verfahren zur Erhebung, Nutzung und Offenlegung Ihrer Informationen bei der Nutzung des Dienstes und informiert Sie über Ihre Datenschutzrechte sowie darüber, wie das Gesetz Sie schützt.",
        "USE_OF_DATA": "Wir verwenden Ihre personenbezogenen Daten, um den Dienst bereitzustellen und zu verbessern. Durch die Nutzung des Dienstes stimmen Sie der Erfassung und Nutzung von Informationen gemäß dieser Datenschutzrichtlinie zu.",
        "INTERPRETATION": "Auslegung und Definitionen",
        "INTERPRETATION_DESCRIPTION": "Die Wörter, deren Anfangsbuchstaben großgeschrieben sind, haben die unter den folgenden Bedingungen definierten Bedeutungen. Diese Definitionen gelten unabhängig davon, ob sie im Singular oder Plural erscheinen.",
        "DEFINITIONS": "Definitionen",
        "DEFINITIONS_TEXT": "Für die Zwecke dieser Datenschutzrichtlinie:",
        "ACCOUNT": "Konto",
        "ACCOUNT_TEXT": "bezeichnet ein einzigartiges Konto, das für Sie erstellt wurde, um auf unseren Dienst oder Teile unseres Dienstes zuzugreifen.",
        "AFFILIATE": "Affiliate",
        "AFFILIATE_TEXT":"bezeichnet eine Einheit, die eine andere kontrolliert, von ihr kontrolliert wird oder unter gemeinsamer Kontrolle mit einer Partei steht, wobei 'Kontrolle' den Besitz von 50 % oder mehr der Anteile, Beteiligungen oder anderer Wertpapiere bedeutet, die zur Wahl von Direktoren oder einer anderen Verwaltungsbehörde berechtigen.",
        "COMPANY": "Unternehmen",
        "COMPANY_TEXT": "(in dieser Vereinbarung als 'das Unternehmen', 'Wir', 'Uns' oder 'Unser' bezeichnet) bezieht sich auf Frontend Developer.",
        "COOKIES": "Cookies", 
        "COOKIES_TEXT": "sind kleine Dateien, die auf Ihrem Computer, Mobilgerät oder einem anderen Gerät von einer Website gespeichert werden und Details Ihres Browserverlaufs auf dieser Website sowie viele weitere Informationen enthalten.",
        "COUNTRY": "Land", 
        "COUNTRY_TEXT": "bezieht sich auf: Berlin, Deutschland",
        "DEVICE": "Gerät", 
        "DEVICE_TEXT": "bezeichnet jedes Gerät, das auf den Dienst zugreifen kann, z. B. ein Computer, ein Mobiltelefon oder ein Tablet.",
        "PERSONAL_DATA": "Personenbezogene Daten",
        "PERSONAL_DATA_TEXT": "sind alle Informationen, die sich auf eine identifizierte oder identifizierbare Person beziehen.",
        "SERVICE": "Dienst", 
        "SERVICE_TEXT": "bezieht sich auf die Website.",
        "SERVICE_PROVIDER": "Dienstanbieter", 
        "SERVICE_PROVIDER_TEXT": "bezeichnet jede natürliche oder juristische Person, die die Daten im Auftrag des Unternehmens verarbeitet. Dazu gehören Drittunternehmen oder Einzelpersonen, die vom Unternehmen beauftragt werden, den Dienst zu ermöglichen, den Dienst im Namen des Unternehmens bereitzustellen, dienstbezogene Dienstleistungen zu erbringen oder das Unternehmen bei der Analyse der Nutzung des Dienstes zu unterstützen.",
        "USAGE_DATA": "Nutzungsdaten", 
        "USAGE_DATA_TEXT": "sind Daten, die automatisch erfasst werden, entweder durch die Nutzung des Dienstes oder durch die Infrastruktur des Dienstes selbst (zum Beispiel die Dauer eines Seitenbesuchs).",
        "COLLECTING_DATA": "Erhebung und Nutzung Ihrer personenbezogenen Daten",
        "TYPES_DATA": "Arten der erhobenen Daten",
        "PERSONAL_DATA_TITLE": "Personenbezogene Daten",  
        "USING_DATA": "Während der Nutzung unseres Dienstes können wir Sie bitten, uns bestimmte personenbezogene Daten bereitzustellen, die zur Kontaktaufnahme oder Identifikation verwendet werden können. Personenbezogene Daten können unter anderem Folgendes umfassen:",
        "EMAIL_ADRESSE": "E-Mail-Adresse",
        "LAST_NAME": "Vorname und Nachname",
        "USAGE_DATA_TITLE": "Nutzungsdaten",
        "USAGE_DATA_TEXT1": "Nutzungsdaten werden automatisch bei der Nutzung des Dienstes erfasst.",
        "USAGE_DATA_TEXT2": "Nutzungsdaten können Informationen wie die IP-Adresse Ihres Geräts, den Browsertyp, die Browserversion, die Seiten unseres Dienstes, die Sie besuchen, das Datum und die Uhrzeit Ihres Besuchs, die auf diesen Seiten verbrachte Zeit, eindeutige Gerätekennungen und andere Diagnosedaten umfassen.",
        "USAGE_DATA_TEXT3": "Wenn Sie auf den Dienst über ein mobiles Gerät zugreifen, können wir automatisch bestimmte Informationen erfassen, einschließlich, aber nicht beschränkt auf den Gerätetyp, die eindeutige ID des Geräts, die IP-Adresse des Geräts, das Betriebssystem des Geräts, den Typ des mobilen Internetbrowsers, eindeutige Gerätekennungen und andere Diagnosedaten.",
        "USAGE_DATA_TEXT4": "Wir können auch Informationen erfassen, die Ihr Browser sendet, wenn Sie unseren Dienst besuchen oder über ein mobiles Gerät auf den Dienst zugreifen.",
        "COOKIES_TITLE": "Tracking-Technologien und Cookies", 
        "COOKIES_TEXT1": "Wir verwenden Cookies und ähnliche Tracking-Technologien, um Aktivitäten auf unserem Dienst zu verfolgen und bestimmte Informationen zu speichern. Zu den verwendeten Tracking-Technologien gehören Beacons, Tags und Skripte, um Informationen zu sammeln, zu verfolgen und unseren Dienst zu verbessern und zu analysieren. Die von uns verwendeten Technologien umfassen:",
        "COOKIES_TEXT2": "Cookies oder Browser-Cookies. Ein Cookie ist eine kleine Datei, die auf Ihrem Gerät gespeichert wird. Sie können Ihren Browser so einstellen, dass alle Cookies abgelehnt werden oder angezeigt wird, wenn ein Cookie gesendet wird. Wenn Sie jedoch keine Cookies akzeptieren, können Sie möglicherweise einige Teile unseres Dienstes nicht nutzen.",
        "COOKIES_TEXT3": "Sofern Sie Ihre Browsereinstellungen nicht so angepasst haben, dass sie Cookies ablehnen, kann unser Dienst Cookies verwenden.",
        "COOKIES_TEXT4": "Web Beacons. Bestimmte Abschnitte unseres Dienstes und unsere E-Mails können kleine elektronische Dateien enthalten, die als Web Beacons (auch bekannt als Clear Gifs, Pixel Tags und Ein-Pixel-Gifs) bekannt sind und es dem Unternehmen ermöglichen, z. B. Benutzer zu zählen, die diese Seiten besucht oder eine E-Mail geöffnet haben, sowie für andere verwandte Website-Statistiken.",
        "COOKIES_TEXT5": "Cookies können 'Persistente' oder 'Session'-Cookies sein. Persistente Cookies verbleiben auf Ihrem persönlichen Computer oder Mobilgerät, wenn Sie offline gehen, während Session-Cookies gelöscht werden, sobald Sie Ihren Webbrowser schließen.",
        "PERSONAL_DATA_USING": "Verwendung Ihrer personenbezogenen Daten", 
            "PERSONAL_DATA_TEXT1": "Das Unternehmen kann personenbezogene Daten für die folgenden Zwecke verwenden:",
            "PERSONAL_DATA_TEXT2": "Um unseren Service bereitzustellen und zu warten, einschließlich der Überwachung der Nutzung unseres Services.",
            "PERSONAL_DATA_TEXT3": "Zur Verwaltung Ihres Kontos: zur Verwaltung Ihrer Registrierung als Benutzer des Services. Die von Ihnen bereitgestellten personenbezogenen Daten können Ihnen Zugang zu verschiedenen Funktionen des Services gewähren, die Ihnen als registrierter Benutzer zur Verfügung stehen.",
            "PERSONAL_DATA_TEXT4": "Zur Erfüllung eines Vertrags: die Entwicklung, Einhaltung und Durchführung des Kaufvertrags für die von Ihnen gekauften Produkte, Artikel oder Dienstleistungen oder eines anderen Vertrags mit uns über den Service.",
            "PERSONAL_DATA_TEXT5": "Um Sie zu kontaktieren: Um Sie per E-Mail, Telefonanruf, SMS oder anderen gleichwertigen Formen der elektronischen Kommunikation zu kontaktieren, wie z. B. Push-Benachrichtigungen einer mobilen Anwendung bezüglich Updates oder informativer Mitteilungen zu Funktionen, Produkten oder vereinbarten Dienstleistungen, einschließlich Sicherheitsupdates, sofern dies notwendig oder angemessen ist.",
            "PERSONAL_DATA_TEXT6": "Um Ihnen Nachrichten, Sonderangebote und allgemeine Informationen über andere Waren, Dienstleistungen und Veranstaltungen bereitzustellen, die denen ähneln, die Sie bereits gekauft oder angefragt haben, es sei denn, Sie haben sich gegen den Erhalt solcher Informationen entschieden.",
            "PERSONAL_DATA_TEXT7": "Zur Verwaltung Ihrer Anfragen: Um Ihre Anfragen an uns zu bearbeiten und zu verwalten.",
            "PERSONAL_DATA_TEXT8": "Für andere Zwecke: Wir können Ihre Informationen für andere Zwecke verwenden, wie z. B. Datenanalyse, Identifizierung von Nutzungstrends, Bestimmung der Wirksamkeit unserer Werbekampagnen sowie zur Bewertung und Verbesserung unseres Services, unserer Produkte, Dienstleistungen, unseres Marketings und Ihrer Erfahrung.",
        "RETENTION": "Aufbewahrung Ihrer personenbezogenen Daten",
      "RETENTION_TEXT1": "Das Unternehmen speichert Ihre personenbezogenen Daten nur so lange, wie es für die in dieser Datenschutzrichtlinie festgelegten Zwecke erforderlich ist.",
        "RETENTION_TEXT2": "Wir speichern und verwenden Ihre personenbezogenen Daten in dem Umfang, der erforderlich ist, um unseren gesetzlichen Verpflichtungen nachzukommen (zum Beispiel, wenn wir Ihre Daten aufbewahren müssen, um geltende Gesetze einzuhalten), Streitigkeiten beizulegen und unsere rechtlichen Vereinbarungen und Richtlinien durchzusetzen.",
        "RETENTION_TEXT3": "Das Unternehmen speichert auch Nutzungsdaten für interne Analysezwecke. Nutzungsdaten werden in der Regel für einen kürzeren Zeitraum aufbewahrt, es sei denn, diese Daten werden zur Stärkung der Sicherheit oder zur Verbesserung der Funktionalität unseres Services verwendet oder wir sind gesetzlich verpflichtet, diese Daten über einen längeren Zeitraum aufzubewahren.",
        "DELETE_DATA": "Löschung Ihrer personenbezogenen Daten", 
        "DELETE_DATA_TEXT1": "Sie haben das Recht, Ihre personenbezogenen Daten zu löschen oder uns um Unterstützung bei der Löschung der von uns über Sie erfassten personenbezogenen Daten zu bitten.",
  "DELETE_DATA_TEXT2": "Unser Service kann Ihnen die Möglichkeit bieten, bestimmte Informationen über Sie direkt innerhalb des Services zu löschen.",
  "DELETE_DATA_TEXT3": "Sie können Ihre Informationen jederzeit aktualisieren, ändern oder löschen, indem Sie sich in Ihr Konto einloggen (falls Sie eines haben) und den Abschnitt mit den Kontoeinstellungen aufrufen, in dem Sie Ihre persönlichen Daten verwalten können. Sie können uns auch kontaktieren, um Zugriff auf Ihre personenbezogenen Daten zu beantragen, diese zu korrigieren oder zu löschen.",
  "DELETE_DATA_TEXT4": "Bitte beachten Sie jedoch, dass wir bestimmte Informationen aufbewahren müssen, wenn wir dazu eine gesetzliche Verpflichtung oder eine rechtmäßige Grundlage haben.",
        "SECURITY_DATA": "Sicherheit Ihrer personenbezogenen Daten", 
        "SECURITY_DATA_TEXT": "Die Sicherheit Ihrer personenbezogenen Daten ist uns wichtig, aber bedenken Sie, dass keine Übertragungsmethode über das Internet oder elektronische Speicherung 100 % sicher ist.",
        "CHANGES_PRIVACY_POLICY": "Änderungen an dieser Datenschutzrichtlinie", 
       "CHANGES_PRIVACY_POLICY_TEXT1": "Wir können unsere Datenschutzrichtlinie von Zeit zu Zeit aktualisieren. Wir werden Sie über Änderungen informieren, indem wir die neue Datenschutzrichtlinie auf dieser Seite veröffentlichen.",
  "CHANGES_PRIVACY_POLICY_TEXT2": "Wir werden Sie per E-Mail und/oder durch einen gut sichtbaren Hinweis in unserem Service über die Änderung informieren, bevor sie in Kraft tritt, und das Datum der letzten Aktualisierung am Anfang dieser Datenschutzrichtlinie anpassen.",
  "CHANGES_PRIVACY_POLICY_TEXT3": "Es wird empfohlen, diese Datenschutzrichtlinie regelmäßig auf Änderungen zu überprüfen. Änderungen an dieser Datenschutzrichtlinie treten in Kraft, sobald sie auf dieser Seite veröffentlicht werden.",
        "CONTACT_US": "Kontakt",
        "CONTACT_US_TEXT1": "Wenn Sie Fragen zu dieser Datenschutzrichtlinie haben, können Sie uns kontaktieren:",
        "CONTACT_US_TEXT2": "Per E-Mail:"

      

}