{
    "hello": "Hello there! I'm",
    "name": "Milica Pesic",
    "job": "Frontend Developer",
    "contact": "Get in Touch",
    "menu": "Menu",
    "about": "About me",
    "skillset": "Skillset",
    "projects": "Projects",
    "references": "References",
    "contactMe": "Contact me",
    "about_me": "About me",
    "about_text_line_1": "I fell in love with frontend development from the moment I wrote my first lines of HTML and CSS.",
    "about_text_line_2": "Over time, I expanded my skills to SCSS, JavaScript and Angular, where I enjoy combining functionality and design to create modern web applications.",
    "about_text_line_3": "Every project brings something new, pushing me to continuously improve and refine my skills as a frontend developer.",
    "about_text_line_4": "Let's connect and create something amazing together!",
    "let_s_talk": "Let's Talk",
    "more_about_me": "More about me",
    "team_player": "Team player",
    "based_in": "Based in Tübingen",
    "always_learning": "Always learning",
    "loves_new_challenges": "Loves new challenges",
    "collaborative_mindset": "Collaborative mindset",
    "core": "Core Competencies",
    "core_text": "In my development journey, I've honed a set of frontend skills that allow me to build dynamic, responsive, and user-friendly web applications.",
    "core_text1": "Discover my projects on the next page and see how I use these technologies to build dynamic web applications!",
    "dont_see_skill": "Don't see the skill you are looking for?",
    "contact_me": "Feel free to contact me.\nI look forward to expanding on my previous knowledge.",
    "my_work": "My work",
    "explore_work": "Explore a selection of my work here - Interact with the projects to see my skills in action.",
    "join_description": "Task manager inspired by the Kanban System. Create and organize tasks using drag and drop functions, assign users and categories.",
    "elpolloloco_description": "A fun Jump-and-run game with an object-oriented approach. Help Pepe collect coins and salsa bottles to defeat the dangerous killer chicken.",
    "new_project_description": "New Project coming soon.",
    "previous_project": "<< Previous project",
    "next_project": "Next project >>",
    "what_my_colleagues_say": "What my colleagues say about me",
    "text_reference1": "Milica has proven to be a reliable group partner. Her technical skills and proactive approach were crucial to the success of our project.",
    "text_reference2": "I had the good fortune of working with Milica in a group project at the Developer Akademie. She always stayed calm, cool, and focused, and made sure our team was set up for success.",
    "text_reference3": "Our project benefited enormously from Milica efficient way of working.",
    "lets_build_together": "Let's build something Cool together!",
    "do_you_have_problem": "Do you have a problem you need to solve?",
    "contact_intro": "I'm a web developer dedicated to crafting modern and user-friendly applications. Whether you need a sleek website or a dynamic web app, I'm here to turn your ideas into reality.",
    "thank_you_message": "Thank you for reaching out! I'll contact you soon.",
    "whats_your_name": "What's your name?",
    "your_name_placeholder": "Your name goes here",
    "name_error": "Oops! It seems your name is missing.",
    "whats_your_email": "What's your email?",
    "email_placeholder": "youremail@email.com",
    "email_error": "Please enter a valid email.",
    "how_can_i_help": "How can I help you?",
    "message_placeholder": "Hello Milica, I am interested in...",
    "message_error": "What do you need to develop?",
    "privacy_police1": "I've read the",
    "privacy_police2": "privacy policy",
    "privacy_police3": "and agree to the processing of my data.",
    "accept_privacy_policy": "Please accept the privacy policy.",
    "drop_a_line": "Drop a Line",
    "imprint": "Imprint",
    "IMPRINT": "Imprint",
    "INFO": "Information according to § 5 DDG",
    "REPRESENTED_BY": "Represented by:",
    "CONTACT": "Contact:",
    "PHONE": "Phone:",
    "EMAIL": "Email:",
    "LIABILITY_TITLE": "Liability for Content",
    "LIABILITY_CONTENT1": "The contents of our pages have been created with the utmost care. However, we cannot guarantee the accuracy, completeness, or timeliness of the content.",
    "LIABILITY_CONTENT2": "As a service provider, we are responsible for our own content on these pages under general laws according to § 7 para.1 DDG.",
    "LIABILITY_CONTENT3": "According to §§ 8 to 10 DDG, we as service providers are not obligated to monitor transmitted or stored external information or to investigate circumstances indicating illegal activity.",
    "LIABILITY_CONTENT4": "Obligations to remove or block the use of information under general laws remain unaffected.",
    "LIABILITY_CONTENT5": "However, liability in this respect is only possible from the moment of knowledge of a specific legal violation.",
    "LIABILITY_CONTENT6": "Upon becoming aware of legal violations, we will remove such content immediately.",
    "LIABILITY_LINKS_TITLE": "Liability for Links",
    "LIABILITY_LINKS_TEXT1": "Our offer contains links to external third-party websites, the content of which we have no influence over.",
    "LIABILITY_LINKS_TEXT2": "Therefore, we cannot assume any liability for this external content.",
    "LIABILITY_LINKS_TEXT3": "The respective provider or operator of the sites is always responsible for the content of the linked pages.",
    "LIABILITY_LINKS_TEXT4": "The linked pages were checked for possible legal violations at the time of linking. ",
    "LIABILITY_LINKS_TEXT5": "Illegal content was not recognizable at the time of linking. ",
    "LIABILITY_LINKS_TEXT6": "However, permanent monitoring of the content of the linked pages is not reasonable without concrete evidence of a legal violation.",
    "LIABILITY_LINKS_TEXT7": "If we become aware of any legal violations, we will remove such links immediately.",
    "COPYRIGHT_TITLE": "Copyright",
    "COPYRIGHT_TEXT1": "The content and works created by the site operators on these pages are subject to German copyright law.",
    "COPYRIGHT_TEXT2": "The duplication, processing, distribution, and any kind of exploitation outside the limits of copyright require the written consent of the respective author or creator.",
    "COPYRIGHT_TEXT3": "Downloads and copies of this page are only permitted for private, non-commercial use.",
    "COPYRIGHT_TEXT4": "Insofar as the content on this site was not created by the operator, the copyrights of third parties are respected.",
    "COPYRIGHT_TEXT5": "In particular, third-party content is marked as such.",
    "COPYRIGHT_TEXT6": "Should you nevertheless become aware of a copyright infringement, please inform us accordingly.",
    "COPYRIGHT_TEXT7": "Upon becoming aware of legal violations, we will remove such content immediately.",
    "IMPRINT_GENERATOR": "Imprint generated by:",

  "PRIVACY_POLICY": "Privacy Policy",
  "LAST_UPDATED": "Last updated: March 06, 2025",
  "INTRO_TEXT": "This Privacy Policy describes Our policies and procedures on the collection, use and disclosure of Your information when You use the Service and tells You about Your privacy rights and how the law protects You.",
  "USE_OF_DATA": "We use Your Personal data to provide and improve the Service. By using the Service, You agree to the collection and use of information in accordance with this Privacy Policy.",
  "INTERPRETATION": "Interpretation and Definitions",
  "INTERPRETATION_DESCRIPTION": "The words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural.",
  "DEFINITIONS": "Definitions",
  "DEFINITIONS_TEXT": "For the purposes of this Privacy Policy:",
  "ACCOUNT": "Account",
  "ACCOUNT_TEXT": "means a unique account created for You to access our Service or parts of our Service.",
  "AFFILIATE": "Affiliate",
  "AFFILIATE_TEXT": "means an entity that controls, is controlled by or is under common control with a party, where \"control\" means ownership of 50% or more of the shares, equity interest or other securities entitled to vote for election of directors or other managing authority.",
  "COMPANY": "Company",
  "COMPANY_TEXT": "(referred to as either \"the Company\", \"We\", \"Us\" or \"Our\" in this Agreement) refers to Frontend Developer.",
  "COOKIES": "Cookies",
  "COOKIES_TEXT": "are small files that are placed on Your computer, mobile device or any other device by a website, containing the details of Your browsing history on that website among its many uses.",
  "COUNTRY": "Country",
  "COUNTRY_TEXT": "refers to: Berlin, Germany",
  "DEVICE": "Device",
  "DEVICE_TEXT": "means any device that can access the Service such as a computer, a cellphone or a digital tablet.",
  "PERSONAL_DATA": "Personal Data",
  "PERSONAL_DATA_TEXT": "is any information that relates to an identified or identifiable individual.",
  "SERVICE": "Service",
  "SERVICE_TEXT": "refers to the Website.",
  "SERVICE_PROVIDER": "Service Provider",
  "SERVICE_PROVIDER_TEXT": "means any natural or legal person who processes the data on behalf of the Company,  It refers to third-party companies or individuals employed by the Company to facilitate the Service, to provide the Service on behalf of the Company, to perform services related to the Service or to assist the Company in analyzing how the Service is used.",
  "USAGE_DATA": "Usage Data",
  "USAGE_DATA_TEXT": "refers to data collected automatically, either generated by the use of the Service or from the Service infrastructure itself (for example, the duration of a page visit).",
  "COLLECTING_DATA": "Collecting and Using Your Personal Data",
  "TYPES_DATA": "Types of Data Collected",
  "PERSONAL_DATA_TITLE": "Personal Data",  
  "USING_DATA": "While using Our Service, We may ask You to provide Us with certain personally identifiable information that can be used to contact or identify You. Personally identifiable information may include, but is not limited to:",
"EMAIL_ADRESSE": "Email address",
"LAST_NAME": "First name and last name",
"USAGE_DATA_TITLE": "Usage Data",
"USAGE_DATA_TEXT1": "is collected automatically when using the Service.",
"USAGE_DATA_TEXT2": "may include information such as Your Device's Internet Protocol address (e.g. IP address), browser type, browser version, the pages of our Service that You visit, the time and date of Your visit, the time spent on those pages, unique device identifiers and other diagnostic data.",
"USAGE_DATA_TEXT3": "When You access the Service by or through a mobile device, We may collect certain information automatically, including, but not limited to, the type of mobile device You use, Your mobile device unique ID, the IP address of Your mobile device, Your mobile operating system, the type of mobile Internet browser You use, unique device identifiers and other diagnostic data.",
"USAGE_DATA_TEXT4": "We may also collect information that Your browser sends whenever You visit our Service or when You access the Service by or through a mobile device.",
"COOKIES_TITLE": "Tracking Technologies and Cookies", 
"COOKIES_TEXT1": "We use Cookies and similar tracking technologies to track the activity on Our Service and store certain information. Tracking technologies used are beacons, tags, and scripts to collect and track information and to improve and analyze Our Service. The technologies We use may include:", 
"COOKIES_TEXT2": "Cookies or Browser Cookies. A cookie is a small file placed on Your Device. You can instruct Your browser to refuse all Cookies or to indicate when a Cookie is being sent. However, if You do not accept Cookies, You may not be able to use some parts of our Service.",
"COOKIES_TEXT3": "Unless you have adjusted Your browser setting so that it will refuse Cookies, our Service may use Cookies.",
"COOKIES_TEXT4": "Web Beacons. Certain sections of our Service and our emails may contain small electronic files known as web beacons (also referred to as clear gifs, pixel tags, and single-pixel gifs) that permit the Company, for example, to count users who have visited those pages or opened an email and for other related website statistics (for example, recording the popularity of a certain section and verifying system and server integrity).",
"COOKIES_TEXT5": "Cookies can be \"Persistent\" or \"Session\" Cookies. Persistent Cookies remain on Your personal computer or mobile device when You go offline, while Session Cookies are deleted as soon as You close Your web browser. Learn more about cookies on the Free Privacy Policy website article.",
"PERSONAL_DATA_USING": "Use of Your Personal Data", 
"PERSONAL_DATA_TEXT1": "The Company may use Personal Data for the following purposes:",
"PERSONAL_DATA_TEXT2": "To provide and maintain our Service, including to monitor the usage of our Service.",
"PERSONAL_DATA_TEXT3": "To manage Your Account: to manage Your registration as a user of the Service. The Personal Data You provide can give You access to different functionalities of the Service that are available to You as a registered user.",
"PERSONAL_DATA_TEXT4": "For the performance of a contract: the development, compliance and undertaking of the purchase contract for the products, items or services You have purchased or of any other contract with Us through the Service.",
"PERSONAL_DATA_TEXT5": "To contact You: To contact You by email, telephone calls, SMS, or other equivalent forms of electronic communication, such as a mobile application's push notifications regarding updates or informative communications related to the functionalities, products or contracted services, including the security updates, when necessary or reasonable for their implementation.",
"PERSONAL_DATA_TEXT6": "To provide You with news, special offers and general information about other goods, services and events which we offer that are similar to those that you have already purchased or enquired about unless You have opted not to receive such information.",
"PERSONAL_DATA_TEXT7": "To manage Your requests: To attend and manage Your requests to Us.",
"PERSONAL_DATA_TEXT8": "For other purposes: We may use Your information for other purposes, such as data analysis, identifying usage trends, determining the effectiveness of our promotional campaigns and to evaluate and improve our Service, products, services, marketing and your experience.",
"RETENTION": "Retention of Your Personal Data",
"RETENTION_TEXT1": "The Company will retain Your Personal Data only for as long as is necessary for the purposes set out in this Privacy Policy.",
"RETENTION_TEXT2": "We will retain and use Your Personal Data to the extent necessary to comply with our legal obligations (for example, if we are required to retain your data to comply with applicable laws), resolve disputes, and enforce our legal agreements and policies.",
"RETENTION_TEXT3": "The Company will also retain Usage Data for internal analysis purposes. Usage Data is generally retained for a shorter period of time, except when this data is used to strengthen the security or to improve the functionality of Our Service, or We are legally obligated to retain this data for longer time periods.",
"DELETE_DATA": "Delete Your Personal Data", 
"DELETE_DATA_TEXT1": "You have the right to delete or request that We assist in deleting the Personal Data that We have collected about You.",
"DELETE_DATA_TEXT2": "Our Service may give You the ability to delete certain information about You from within the Service.",
"DELETE_DATA_TEXT3": "You may update, amend, or delete Your information at any time by signing in to Your Account, if you have one, and visiting the account settings section that allows you to manage Your personal information. You may also contact Us to request access to, correct, or delete any personal information that You have provided to Us.",
"DELETE_DATA_TEXT4": "Please note, however, that We may need to retain certain information when we have a legal obligation or lawful basis to do so.",
"SECURITY_DATA": "Security of Your Personal Data", 
"SECURITY_DATA_TEXT": "The security of Your Personal Data is important to Us, but remember that no method of transmission over the Internet, or method of electronic storage is 100% secure. While We strive to use commercially acceptable means to protect Your Personal Data, We cannot guarantee its absolute security.",
"CHANGES_PRIVACY_POLICY": "Changes to this Privacy Policy", 
"CHANGES_PRIVACY_POLICY_TEXT1": "We may update Our Privacy Policy from time to time. We will notify You of any changes by posting the new Privacy Policy on this page.", 
"CHANGES_PRIVACY_POLICY_TEXT2": "We will let You know via email and/or a prominent notice on Our Service, prior to the change becoming effective and update the \"Last updated\" date at the top of this Privacy Policy.", 
"CHANGES_PRIVACY_POLICY_TEXT3": "You are advised to review this Privacy Policy periodically for any changes. Changes to this Privacy Policy are effective when they are posted on this page.", 
"CONTACT_US": "Contact Us",
"CONTACT_US_TEXT1": "If you have any questions about this Privacy Policy, You can contact us:",
"CONTACT_US_TEXT2": "By email:"
}